---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthsForArcsDisplayOption
source: html/74bb7008-f7d2-0bf2-4a53-dcf37df09652.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthsForArcsDisplayOption Property

"Arc Segment Lengths"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeSegmentLengthsForArcsDisplayOption { get; }
```